import React from "react";
import "./PrincipleMassageUrdu.css";
import domePic from "../../../assets/dome-pic.png";
import logoPic from "../../../assets/darulUloomLogopic.png";
import bismillah from "../../../assets/bismillah-pic.png";

const PrincipleMassageUrdu = () => {
  return (
    <div className="principleMassage">
      <div className="left">
        <img src={domePic} />
      </div>
      <div className="right rightUrdu">
        <img src={bismillah} alt="" />
        <h4>السلام علیکم ورحمۃ اللہ وبرکاتہ</h4>
        <p>
          دارالعلوم مصطفائیہ میں آپ کو خوش آمدید۔ یہ مبارک ادارہ 1403 ہجری
          (1981ء) میں قائم ہوا، جس کا مقصد قرآنِ مجید، سنتِ رسولِ اکرم ﷺ اور
          اہلِ سنت و جماعت کی مستند علمی روایت کی روشنی میں خالص دینی تعلیم
          فراہم کرنا ہے۔ اس کے ساتھ طلبہ کو انگریزی اور کمپیوٹر کی تعلیم بھی دی
          جاتی ہے، تاکہ وہ دینی بصیرت کے ساتھ جدید علوم و فنون سے بھی آراستہ
          ہوں۔{" "}
        </p>

        <p>
          ہمارا یقین ہے کہ حقیقی کامیابی صرف علم حاصل کرنے میں نہیں، بلکہ علم کے
          ساتھ تقویٰ، حسنِ اخلاق، نظم و ضبط، کردار سازی اور خدمتِ خلق کو اپنانے
          میں ہے۔ ہماری کوشش ہے کہ ایسے باصلاحیت، باکردار اور ذمہ دار طلبہ تیار
          ہوں جو روحانی، علمی اور اخلاقی اعتبار سے مضبوط ہوں اور اپنی صلاحیتوں
          کے ذریعے امتِ مسلمہ اور پورے معاشرے کی مثبت رہنمائی کر سکیں۔
        </p>
        <p>
          میں تمام طلبہ، والدین اور اہلِ خیر کو دعوت دیتا ہوں کہ اس مبارک تعلیمی
          سفر کا حصہ بنیں۔ آئیے! ہم سب مل کر ایمان، علم، حکمت اور بہترین اخلاق
          سے مزین ایسی نسل کی تعمیر کریں جو دین و ملت اور انسانیت کے لیے باعثِ
          خیر و برکت ثابت ہو۔
        </p>
        <p>
          اللہ تعالیٰ ہماری تمام کوششوں کو اپنی بارگاہ میں شرفِ قبولیت عطا
          فرمائے، اس ادارے کو دن دوگنی رات چوگنی ترقی نصیب فرمائے اور ہمارے تمام
          طلبہ کو دین و دنیا کی کامیابیوں سے سرفراز فرمائے۔ آمین یا رب العالمین
        </p>

        <hr />
        <div className="rightBottom rightBottomUrdu">
          <h2>پرنسپل</h2>
          <p>دارالعلوم مصطفائیہ ہلدروا</p>
        </div>
      </div>
    </div>
  );
};

export default PrincipleMassageUrdu;
